import asyncio
import logging
from aiogram import Bot, Dispatcher, types, F
from aiogram.filters import Command
from aiogram.types import WebAppInfo

# 1. КОНФИГУРАЦИЯ
# Сюда вставь токен, который дал BotFather
TOKEN = "8595417826:AAH4bCiGjFZrt1pZ8Kdrw57C4G5Gd1Vy9hE" 

# Сюда вставь ту самую ссылку, которую мы получили на GitHub Pages
WEBAPP_URL = "https://k0ra09.github.io/rusreef_bot/webapp/index.html"

# Включаем логирование, чтобы видеть в консоли, что происходит с ботом
logging.basicConfig(level=logging.INFO)

# Создаем объекты бота и диспетчера
# Диспетчер (dp) отвечает за обработку входящих сообщений
bot = Bot(token=TOKEN)
dp = Dispatcher()

# 2. ОБРАБОТЧИКИ (HANDLERS)

# Этот блок срабатывает, когда юзер пишет команду /start
@dp.message(Command("start"))
async def cmd_start(message: types.Message):
    """
    Функция отправляет приветствие и кнопку для открытия WebApp.
    """
    
    # Создаем кнопку. 
    # В параметр web_app мы передаем нашу ссылку.
    # Это говорит Телеграму: "По нажатию не шли текст, а открой окно".
    keyboard = types.ReplyKeyboardMarkup(
        keyboard=[
            [types.KeyboardButton(text="🌊 Открыть Дневник", web_app=WebAppInfo(url=WEBAPP_URL))]
        ],
        resize_keyboard=True # Делаем кнопку компактной
    )

    # Отправляем сообщение с клавиатурой
    await message.answer(
        "Привет! Я RusReef Bot.\nНажми кнопку ниже, чтобы управлять аквариумом.",
        reply_markup=keyboard
    )

# 3. ЗАПУСК
async def main():
    """
    Главная функция запуска бота.
    """
    print("Бот запущен...")
    # Удаляем старые обновления (чтобы бот не отвечал на сообщения, присланные, пока он спал)
    await bot.delete_webhook(drop_pending_updates=True)
    # Запускаем постоянный опрос серверов Телеграма (polling)
    await dp.start_polling(bot)

# Стандартная конструкция для запуска Python скрипта
if __name__ == "__main__":
    try:
        asyncio.run(main())
    except KeyboardInterrupt:
        print("Бот выключен")